---
kind: type
id: T:Autodesk.Revit.DB.RPCNode
source: html/9ee6a5bf-c2e7-948b-632b-22af7659baf4.htm
---
# Autodesk.Revit.DB.RPCNode

This class represents an RPC content in a model-exporting process.

## Syntax (C#)
```csharp
public class RPCNode : ContentNode
```

## Remarks
See also: OnRPC(RPCNode) .